app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE (read = 't') ORDER BY created_at DESC
---
  def index
    @title = 'Comments'
    @read = Comment.where('read = ?', true).order('created_at DESC')

INSERT INTO "comments" ("content", "created_at", "email", "read", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @comment = Comment.new(params[:comment])
    if @comment.save

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def destroy
    Comment.find(params[:id]).destroy

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "comments" SET "read" = 't', "updated_at" = '2012-12-14 20:13:51.361534' WHERE "comments"."id" = 1
---
  def read
    comment = Comment.find(params[:id])
    comment.read = true
    comment.save