app/controllers/pages_controller.rb

  def about
    @title = 'About'
    @photos = Photo.order('created_at DESC').paginate(page:
      params[:page], per_page: 6)
---
SELECT COUNT(*) FROM "photos"