app/controllers/photos_controller.rb

  def index
    @title = 'Photos'
    @photos = Photo.order('created_at DESC')
---
SELECT "photos".* FROM "photos" ORDER BY created_at DESC