app/controllers/posts_controller.rb

  def blog
    @title = 'Blog'
    @posts = Post.where('published = ?', true).paginate(page: params[:page],
      per_page: 5)
---
SELECT "posts".* FROM "posts" WHERE (published = 't') ORDER BY posts.published_date DESC
SELECT COUNT(*) FROM "posts" WHERE (published = 't')

  def show
    @post = Post.find(params[:id])
    @title = @post.name
    if @post.content[/(<img("[^"]*"|[^>])+)(?<!\/)>/i]
      if @post.content[/(<img("[^"]*"|[^>])+)(?<!\/)>/i].split('"')[3]
        @image = @post.content[/(<img("[^"]*"|[^>])+)(?<!\/)>/i].split('"')[3]
      else
        @image = @post.content[/(<img("[^"]*"|[^>])+)(?<!\/)>/i].split('"')[1]
      end
    else
      @image = 'http://s3.amazonaws.com/caldjs/logo.png'
    end
    @post.increment!(:views, by = 1)
    @posts = Post.where("published = ?", true)
    if @post.published?
      @next_post = @posts[@posts.index(@post) - 1]
      @prev_post = @posts[@posts.index(@post) + 1]
    end
    rescue ActiveRecord::RecordNotFound
      redirect_to root_path
  end

  def index
    @title = 'Posts'
    @posts = Post.where('published = ?', false).order(
      'created_at ASC').paginate(page: params[:page], per_page: 5)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY posts.published_date DESC LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "views" = 1 WHERE "posts"."id" IN (SELECT "posts"."id" FROM "posts" WHERE "posts"."id" = 1 ORDER BY posts.published_date DESC)
SELECT "posts".* FROM "posts" WHERE (published = 'f') ORDER BY posts.published_date DESC, created_at ASC LIMIT 5 OFFSET 0

  def create
    @post = Post.new(params[:post])
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "name", "published", "published_date", "slug", "updated_at", "views") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def publish
    post = Post.find(params[:id])
    if post.published?
      post.update_attributes(published: false, published_date: nil)
---
UPDATE "posts" SET "published" = 't', "published_date" = '2012-12-14 23:02:20.661753', "updated_at" = '2012-12-14 23:02:20.663753' WHERE "posts"."id" = 1