app/controllers/users_controller.rb

  def edit
    @title = 'Edit Profile'
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def update
    @user = User.find(params[:id])
    params[:user][:email] = params[:user][:email].downcase
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "salt" = 'f2fe1d806e2ad4bc94fcbac82f64417033c4fe674bf30e77d90e90da4d3243f4', "encrypted_password" = '7dbe4e488d7eace712882709f8a265a6ac3509eecb738b22b3793fb368d1c5a9', "updated_at" = '2012-12-15 22:42:46.221013' WHERE "users"."id" = 1